#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AttemptToEnterLobby_Flow

#include "Basic.hpp"

#include "Backrooms_structs.hpp"
#include "AdvancedSessions_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_AttemptToEnterLobby_Flow.BP_AttemptToEnterLobby_Flow_C.ExecuteUbergraph_BP_AttemptToEnterLobby_Flow
// 0x01F0 (0x01F0 - 0x0000)
struct BP_AttemptToEnterLobby_Flow_C_ExecuteUbergraph_BP_AttemptToEnterLobby_Flow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOnJoinSessionCompleteFancyResult             K2Node_CustomEvent_Result_1;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EOnJoinSessionCompleteFancyResult Result)> K2Node_CreateDelegate_OutputDelegate;  // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EOnJoinSessionCompleteFancyResult             K2Node_CustomEvent_Result;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EOnJoinSessionCompleteFancyResult Result)> K2Node_CreateDelegate_OutputDelegate_1; // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	EOnJoinSessionCompleteFancyResult             Temp_byte_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOnJoinSessionCompleteFancyResult             Temp_byte_Variable_1;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_2;                              // 0x0060(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_3;                              // 0x0078(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_4;                              // 0x0090(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_5;                              // 0x00A8(0x0018)(ConstParm)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00C8(0x0018)(ConstParm)
	class FName                                   Temp_name_Variable;                                // 0x00E0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00E8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsoleBuild_ReturnValue;               // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const bool SessionInfo)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPUniqueNetId                         CallFunc_GetUniqueNetID_UniqueNetId;               // 0x0148(0x0028)()
	class UCheckSubscriptionCallbackProxy*        CallFunc_CheckSubscription_ReturnValue;            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MyGameInstance_C*                   CallFunc_GetGameInstance_ReturnValue;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SessionInfo;                    // 0x0188(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MyGameInstance_C*                   CallFunc_GetGameInstance_ReturnValue_1;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFancyDestroySessionCallbackProxy*      CallFunc_FancyDestroySession_ReturnValue;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFancyDestroySessionCallbackProxy*      CallFunc_FancyDestroySession_ReturnValue_1;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOnAnySonyPlatform_ReturnValue;          // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AB[0x1];                                      // 0x01AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x01AC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFancyJoinSessionCallbackProxy*         CallFunc_FancyJoinSession_ReturnValue;             // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const bool SessionInfo)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MyGameInstance_C*                   CallFunc_GetGameInstance_ReturnValue_2;            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SessionInfo_1;                  // 0x01E0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetFocusedWidget_ReturnValue;             // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AttemptToEnterLobby_Flow_C_ExecuteUbergraph_BP_AttemptToEnterLobby_Flow;

// Function BP_AttemptToEnterLobby_Flow.BP_AttemptToEnterLobby_Flow_C.OnSuccess_1ADC80B6492FC6B5A0960B9340AF9E0E
// 0x0001 (0x0001 - 0x0000)
struct BP_AttemptToEnterLobby_Flow_C_OnSuccess_1ADC80B6492FC6B5A0960B9340AF9E0E final
{
public:
	EOnJoinSessionCompleteFancyResult             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AttemptToEnterLobby_Flow_C_OnSuccess_1ADC80B6492FC6B5A0960B9340AF9E0E;

// Function BP_AttemptToEnterLobby_Flow.BP_AttemptToEnterLobby_Flow_C.OnFailure_1ADC80B6492FC6B5A0960B9340AF9E0E
// 0x0001 (0x0001 - 0x0000)
struct BP_AttemptToEnterLobby_Flow_C_OnFailure_1ADC80B6492FC6B5A0960B9340AF9E0E final
{
public:
	EOnJoinSessionCompleteFancyResult             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AttemptToEnterLobby_Flow_C_OnFailure_1ADC80B6492FC6B5A0960B9340AF9E0E;

// Function BP_AttemptToEnterLobby_Flow.BP_AttemptToEnterLobby_Flow_C.OnSuccess_1AF601CC4208579E90FF82B097455828
// 0x0001 (0x0001 - 0x0000)
struct BP_AttemptToEnterLobby_Flow_C_OnSuccess_1AF601CC4208579E90FF82B097455828 final
{
public:
	bool                                          SessionInfo;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AttemptToEnterLobby_Flow_C_OnSuccess_1AF601CC4208579E90FF82B097455828;

// Function BP_AttemptToEnterLobby_Flow.BP_AttemptToEnterLobby_Flow_C.OnFailure_1AF601CC4208579E90FF82B097455828
// 0x0001 (0x0001 - 0x0000)
struct BP_AttemptToEnterLobby_Flow_C_OnFailure_1AF601CC4208579E90FF82B097455828 final
{
public:
	bool                                          SessionInfo;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AttemptToEnterLobby_Flow_C_OnFailure_1AF601CC4208579E90FF82B097455828;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
