#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CostumeSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Backrooms_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_CostumeSelector.BP_CostumeSelector_C
// 0x00B0 (0x03D0 - 0x0320)
class ABP_CostumeSelector_C final : public ACostumeSelector
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Hazmat;                                            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MoveBack_T_4106B88943B1DC138856ED905A63DC97;       // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MoveBack__Direction_4106B88943B1DC138856ED905A63DC97; // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MoveBack;                                          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnCompleteLoadedFeedback;                          // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnCompleteLoadingFeedback;                         // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTransform                             ActorBackgroundedTransform;                        // 0x0360(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             ActorForegroundedTransform;                        // 0x0390(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TMulticastInlineDelegate<void()>              OnCompleteExitTransition;                          // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_CostumeSelector(int32 EntryPoint);
	void TransitionToCostumeSelector();
	void TransitionFromCostumeSelector(class AActor* TransitionToViewTarget, const TDelegate<void()>& FeedbackCompleteCallback);
	void OnExitCostumeSelect();
	void OnStartedCostumeSelect();
	void ShowLoadingFeedback(const TDelegate<void()>& FeedbackCompleteCallback);
	void ShowLoadedFeedback(const TDelegate<void()>& FeedbackCompleteCallback);
	void ReceiveBeginPlay();
	void MoveBack__UpdateFunc();
	void MoveBack__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CostumeSelector_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CostumeSelector_C")
	}
	static class ABP_CostumeSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CostumeSelector_C>();
	}
};
DUMPER7_ASSERTS_ABP_CostumeSelector_C;

SDK_NAMESPACE_END
