#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MyGameInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_GameMode_structs.hpp"
#include "E_Difficulty_structs.hpp"
#include "E_HeadsetType_structs.hpp"
#include "Backrooms_structs.hpp"
#include "Backrooms_classes.hpp"
#include "AdvancedSessions_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_MyGameInstance.BP_MyGameInstance_C
// 0x01A0 (0x0418 - 0x0278)
class UBP_MyGameInstance_C final : public UFancyGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_LoadingScreen_C*                     W_LoadingScreenRef;                                // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   LoadingMessage;                                    // 0x0288(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   LoadingMessageTip;                                 // 0x02A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          AlreadyIntro_;                                     // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeLoadingBeforeContinue;                         // 0x02BC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AMP_PlayerController_C*>         ToRespawn;                                         // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	E_Difficulty                                  Difficulty;                                        // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasKicked;                                         // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Code;                                              // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          FromHub;                                           // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsExit;                                            // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasSeenSanityWarning;                              // 0x02EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EB[0x5];                                      // 0x02EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, E_HeadsetType>            HeadsetMap;                                        // 0x02F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 ExtraData;                                         // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsLoading;                                         // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastXP;                                            // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_GameMode                                    CurrentMode;                                       // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   StartingLevel;                                     // 0x035C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DidCompleteMission;                                // 0x0364(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMissionStructure                      MissionCompleteData;                               // 0x0368(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasSeenGlowstickHint;                              // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasSeenRadioHint;                                  // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CA[0x2];                                      // 0x03CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MissionCompletionTime;                             // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPrivateGame;                                     // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxPlayers;                                        // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasLostConnection;                                 // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           AchievementQueue;                                  // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsCurrentlyUnlockingAchievement;                   // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasPremium;                                        // 0x03F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PremiumDialogCompleted;                            // 0x03F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F3[0x5];                                      // 0x03F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 PlayerNum, EBPLoginStatus PreviousStatus, EBPLoginStatus NewStatus, const struct FBPUniqueNetId& NewPlayerUniqueNetID)> OnPlayerLoginStatusChange; // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          InitialPremiumCheckDone;                           // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ErrorModal_C*                        ErrorModal;                                        // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MyGameInstance(int32 EntryPoint);
	void HandleConnectionStatusChanged(EOnlineStatus OldConnectionStatus, EOnlineStatus NewConnectionStatus);
	void HandleNetworkError(ENetworkFailure FailureType, bool bIsServer);
	void HideLoadingScreen();
	void ShowLoadingScreen(class APlayerController* PlayerController, const class FText& Message);
	void OnFindInviteSessionFailure();
	void OnUserChanged(bool bIsSameUser);
	void OnPlayerLoginStatusChanged(int32 PlayerNum, EBPLoginStatus PreviousStatus, EBPLoginStatus NewStatus, const struct FBPUniqueNetId& NewPlayerUniqueNetID);
	void ReturnToMainMenu();
	void OnApplicationDeactivate();
	void OnApplicationReactivate();
	void InitializeUserHandlingEvents();
	void CheckPremiumState();
	void ShowPremiumAccountUpgradeDialog();
	void StartAchievementCheckTimer();
	void CheckAchievementQueue();
	void UnlockAchievementFromQueue(class FName Name_0);
	void FramePacingOnXSS();
	void UpdateMissionTime(float DeltaSeconds);
	void OnInputDeviceChangedEvent(const EFancyInputDevice NewInputDevice);
	void CreateServer(class APlayerController* PlayerController, class UWidget* WidgetRef, class UWidget* ParentRef, class FName LevelName, int32 MaxPlayer, bool IsPrivate);
	void ReceiveShutdown();
	void OnSteamOverlayIsActive(bool isOverlayActive);
	void JoinServerSession(const struct FBlueprintSessionResult& Session, class APlayerController* PlayerController, class UWidget* ParentRef, bool ShowLoadingScreen);
	void ResetAfterErrorFocus(class APlayerController* PlayerController, class UWidget* Widget);
	void UnlockAchievement(class FName AchievementName, class APlayerController* PlayerController);
	void OnPlayerTalkingStateChanged(const struct FBPUniqueNetId& PlayerId, bool bIsTalking);
	void OnSessionInviteAccepted(int32 LocalPlayerNum, const struct FBPUniqueNetId& PersonInvited, const struct FBlueprintSessionResult& SessionToJoin);
	void ReceiveInit();
	void Initialize_AudioSettings();
	void OnSuccess_DA31791B43CC9383FE2FAAA3489B551C();
	void OnFailure_DA31791B43CC9383FE2FAAA3489B551C();
	void OnSuccess_8D32C966478C31E18DECF896A41FD4CE(const bool SessionInfo);
	void OnFailure_8D32C966478C31E18DECF896A41FD4CE(const bool SessionInfo);
	void OnSuccess_C5B79B204D20B91A7829848F8D941EA8(const bool SessionInfo);
	void OnFailure_C5B79B204D20B91A7829848F8D941EA8(const bool SessionInfo);
	void OnSuccess_4A8E1BF4489B644EBB46CCB5CE87A8FB();
	void OnFailure_4A8E1BF4489B644EBB46CCB5CE87A8FB();
	void OnSuccess_F6A1C64C4BF407E4C67D4F8266759C0F(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag);
	void OnFailure_F6A1C64C4BF407E4C67D4F8266759C0F(class FName WrittenAchievementName, float WrittenProgress, int32 WrittenUserTag);
	void OnSuccess_D7E8A28A46B4BD5B7318A6A66AFD14E2();
	void OnFailure_D7E8A28A46B4BD5B7318A6A66AFD14E2();
	void GenerateCode();
	void CheckCodeUnique(const struct FSessionsSearchSetting& Code_0);
	void ResetInput();
	void CheckShouldDisplayEvent();
	void UpdatePlayerSpeakingInScoreboard(const struct FBPUniqueNetId& NetId, bool IsSpeaking);
	bool IsPremiumAvailable();
	void PatchInputIni();
	bool IsOnline();
	void Fix_Resolution_On_Steam_Deck();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MyGameInstance_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MyGameInstance_C")
	}
	static class UBP_MyGameInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MyGameInstance_C>();
	}
};
DUMPER7_ASSERTS_UBP_MyGameInstance_C;

SDK_NAMESPACE_END
