#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GM_MainMenu

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function GM_MainMenu.GM_MainMenu_C.ExecuteUbergraph_GM_MainMenu
// 0x0048 (0x0048 - 0x0000)
struct GM_MainMenu_C_ExecuteUbergraph_GM_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_MainMenu_C*>                  CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UW_MainMenu_C*                          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Message;                              // 0x0020(0x0018)(ConstParm)
	class UWidget*                                K2Node_Event_PreviousFocusedWidget;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GM_MainMenu_C_ExecuteUbergraph_GM_MainMenu;

// Function GM_MainMenu.GM_MainMenu_C.ResetInputModeToDefault
// 0x0008 (0x0008 - 0x0000)
struct GM_MainMenu_C_ResetInputModeToDefault final
{
public:
	class UWidget*                                PreviousFocusedWidget;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GM_MainMenu_C_ResetInputModeToDefault;

// Function GM_MainMenu.GM_MainMenu_C.ShowNonModalMessage
// 0x0018 (0x0018 - 0x0000)
struct GM_MainMenu_C_ShowNonModalMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GM_MainMenu_C_ShowNonModalMessage;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
